Revit 2026 API
GroundConductorSizeSet.Erase Method
Removes a specified GroundConductorSize from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public virtual int Erase(
	GroundConductorSize item
)
Public Overridable Function Erase (
	item As GroundConductorSize
) As Integer
public:
virtual int Erase(
	GroundConductorSize^ item
)
abstract Erase :
        item : GroundConductorSize -> int
override Erase :
        item : GroundConductorSize -> int
Parameters
item GroundConductorSize
The GroundConductorSize to be erased.
Return Value
Int32
The number of GroundConductorSizes that were erased from the set.
See Also
Reference
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace